/****************************************************************************
Скрипт генерации пусто БД. Version = 0
****************************************************************************/

/****************************************************************************
Таблица settings - используется для хранения произвольных настроек в формате
	key - value
****************************************************************************/
CREATE TABLE "settings" 
(
	"key"               TEXT PRIMARY KEY  NOT NULL,        -- Текстовый ключ для идентификации параметра
	"val"               TEXT                               -- Значение параметра
);
INSERT INTO "settings" VALUES("version", "0");

/****************************************************************************
Дополнительные настройки
****************************************************************************/
PRAGMA journal_mode=WAL;                                -- Включаем режим Write-Ahead Logging